siege.txt
original.myredditall.com
Lifting the server siege...      done.                                                                              Transactions:                    1452 hits
Availability:                  99.86 %
Elapsed time:                  60.00 secs
Data transferred:              83.22 MB
Response time:                  0.82 secs
Transaction rate:              24.20 trans/sec
Throughput:                     1.39 MB/sec
Concurrency:                   19.80
Successful transactions:        1452
Failed transactions:               2
Longest transaction:            2.78
Shortest transaction:           0.21

myredditall.com
Lifting the server siege...      done.                                                                              Transactions:                    2586 hits
Availability:                 100.00 %
Elapsed time:                  59.41 secs
Data transferred:              42.80 MB
Response time:                  0.41 secs
Transaction rate:              43.53 trans/sec
Throughput:                     0.72 MB/sec
Concurrency:                   17.65
Successful transactions:        2586
Failed transactions:               0
Longest transaction:           10.19
Shortest transaction:           0.09

# 	URL 	Average 	Median 	StdDev
1	myredditall.com	9.55	8.62	1.22
2	original.myredditall.com	1.16	1.19	0.19